/********************************************************************************
 *                              USDK(1100)
 *                             Module: app 
 *                 Copyright(c) 2003-2009 Actions Semiconductor,
 *                            All Rights Reserved. 
 * File : menu.h
 * History:         
 *      <author>    <time>           <version >             <desc>
 *    songzhining    2009-04-21         v1.0               build this file 
 ********************************************************************************/
/*!
 * \file     menu.h
 * \brief    menu data operation
 * \author   songzhining
 *               
 * \version 1.0
 * \date  2009/04/21
 *******************************************************************************/

/*! 
 * \defgroup   common_menuview    menu ²Ëµ¥Êı¾İ½á¹¹ºÍ½Ó¿Úº¯Êı
 */

#ifndef __MENU_H__
#define __MENU_H__

#include "include_case.h"

/*!
 *  \brief 
 *  menu ²Ëµ¥ÏîµÄĞÅºÅ»Øµ÷º¯ÊıÀàĞÍ
 */
typedef int (*item_cb_t)( void *, int );

/*!
 *  \brief 
 *  menu ²Ëµ¥ÏîÊı¾İ½á¹¹¶¨Òå
 */
typedef struct menuitem_s
{
    /*! Î´Ñ¡ÖĞĞĞÍ¼±êIDç */
    int unsel_icon_id;
    
    /*! Ñ¡ÖĞĞĞÍ¼±êID */
    int sel_icon_id;
    
    /*! ²Ëµ¥Ïî¾²Ì¬ÎÄ±¾ID */
    int text_id;
    
    /*! ²Ëµ¥ÏîÊÇ·ñÓĞÏÂÒ»¼¶±êÖ¾ */
    bool has_child;
    
    /*! ²Ëµ¥ÏîµÄ»Øµ÷º¯Êı */
    item_cb_t callback;
    
    /*! ²Ëµ¥Ïî¶¯Ì¬ÎÄ±¾ */
    char *text;
    
    /*! ²Ëµ¥ÏîµÄÏêÏ¸ĞÅÏ¢1 */
    char *info1;
    
    /*! ²Ëµ¥ÏîµÄÏêÏ¸ĞÅÏ¢2 */
    char *info2;
    
    /*! ¶¯Ì¬Í¼Æ¬Êı¾İÖ¸Õë */
    gui_bitmap_info_t *bitmap;
    
}menuitem_t;

/*!
 *  \brief 
 *  menu ²Ëµ¥µÄĞÅºÅ»Øµ÷º¯ÊıÀàĞÍ
 */
typedef int (*menu_cb_t)( void *, int );

/*!
 *  \brief 
 *  menu ²Ëµ¥Êı¾İ½á¹¹¶¨Òå
 */
typedef struct menu_s
{
    /*! µ±Ç°ÆÁÄ»ÏÔÊ¾ÆğÊ¼ÏîµÄË÷Òı (È¡Öµ: 0 ~ N-1) */
    int offset;
    
    /*! µ±Ç°Ñ¡ÖĞ²Ëµ¥ÏîµÄË÷Òı (È¡Öµ: 0 ~ N-1) */
    int current;

    /*! ²Ëµ¥ÏîµÄ×ÜÊı */
    int total;
    
    /*! ²Ëµ¥ÔÚÈ«¾ÖËùÓĞÏîÖĞµÄÆ«ÒÆ (È¡Öµ: 0 ~ N-1) */
    int global_offset;
    
    /*! È«¾ÖËùÓĞÏîµÄ×ÜÊı */
    int global_size;

    /*! ²Ëµ¥µÄ»Øµ÷º¯Êı */
    menu_cb_t callback;    

    /*! ÄÚ²¿Ë½ÓĞ²Ëµ¥ÏîÊı¾İ½á¹¹, ½ö¹©ÄÚ²¿ÊµÏÖÊ¹ÓÃ */
    struct menuitem_inner_s *head;

}menu_t;


/* ²Ëµ¥ÏîÊı¾İ ½Ó¿Úº¯Êı */

/******************************************************************************/
/*!                    
* \par  Description:
*     ´´½¨Ò»¸ö¿ÕµÄ²Ëµ¥Ïî  
* \ingroup common_menuview
* \param [in] ÎŞ
* \return  ³É¹¦·µ»ØÒ»¸ö ²Ëµ¥Ïî Ö¸Õë, Ê§°Ü·µ»ØNULL
* \note ²Ëµ¥Ïî´´½¨ºó×Ô¶¯Çå¿ÕÄÚÈİ
*******************************************************************************/
menuitem_t* menuitem_create( void );

/******************************************************************************/
/*!                    
* \par  Description:
*     É¾³ıÒ»¸ö²Ëµ¥Ïî 
* \ingroup common_menuview
* \param [in] item: ²Ëµ¥ÏîÖ¸Õë
* \return  ³É¹¦·µ»Øtrue, Ê§°Ü·µ»Øfalse  
*******************************************************************************/
bool menuitem_delete( menuitem_t *item );


/* ²Ëµ¥Êı¾İ »ù±¾½Ó¿Úº¯Êı */

/******************************************************************************/
/*!                    
* \par  Description:
*     ´´½¨Ò»¸ö¿ÕµÄ²Ëµ¥
* \ingroup common_menuview
* \param [in] ÎŞ
* \return  ³É¹¦·µ»ØÒ»¸ö ²Ëµ¥ Ö¸Õë, Ê§°Ü·µ»ØNULL
*******************************************************************************/
menu_t* menu_create( void );

/******************************************************************************/
/*!                    
* \par  Description:
*     É¾³ıÒ»¸ö²Ëµ¥Ïî
* \ingroup common_menuview
* \param [in] menu: ²Ëµ¥Ö¸Õë
* \return  ³É¹¦·µ»Øtrue, Ê§°Ü·µ»Øfalse      
*******************************************************************************/
bool menu_delete( menu_t *menu );

/******************************************************************************/
/*!                    
* \par  Description:
*     menu ÉèÖÃµ±Ç°ÏîµÄË÷Òı
* \ingroup common_menuview
* \param [in] menu: ²Ëµ¥Ö¸Õë
* \param [in] current: µ±Ç°ÏîµÄË÷Òı (È¡Öµ: 0 ~ N-1)
* \return  ³É¹¦·µ»Øtrue, Ê§°Ü·µ»Øfalse 
*******************************************************************************/
bool menu_set_cur_index( menu_t *menu, int current );

/******************************************************************************/
/*!                    
* \par  Description:
*     menu »ñÈ¡µ±Ç°ÏîµÄË÷Òı
* \ingroup common_menuview
* \param [in] menu: ²Ëµ¥Ö¸Õë   
* \return  ³É¹¦·µ»Ø µ±Ç°ÏîµÄË÷Òı (È¡Öµ: 0 ~ N-1), Ê§°Ü·µ»Ø -1
*******************************************************************************/
int menu_get_cur_index( menu_t *menu );

/******************************************************************************/
/*!                    
* \par  Description:
*     menu ÉèÖÃÏÔÊ¾ÆğÊ¼ĞĞµÄË÷Òı
* \ingroup common_menuview
* \param [in] menu: ²Ëµ¥Ö¸Õë
* \param [in] offset: ÏÔÊ¾ÆğÊ¼ĞĞµÄË÷Òı (È¡Öµ: 0 ~ N-1)
* \return  ³É¹¦·µ»Øtrue, Ê§°Ü·µ»Øfalse      
*******************************************************************************/
bool menu_set_offset( menu_t *menu, int offset );

/******************************************************************************/
/*!                    
* \par  Description:
*     menu »ñÈ¡ÏÔÊ¾ÆğÊ¼ĞĞµÄË÷Òı
* \ingroup common_menuview
* \param [in] menu: ²Ëµ¥Ö¸Õë   
* \return  ³É¹¦·µ»Ø ÏÔÊ¾ÆğÊ¼ĞĞµÄË÷Òı (È¡Öµ: 0 ~ N-1), Ê§°Ü·µ»Ø -1
*******************************************************************************/
int menu_get_offset( menu_t *menu );

/******************************************************************************/
/*!                    
* \par  Description:
*     menu »ñÈ¡²Ëµ¥ÏîµÄ×ÜÊı
* \ingroup common_menuview
* \param [in] menu: ²Ëµ¥Ö¸Õë   
* \return  ³É¹¦·µ»Ø ²Ëµ¥ÏîµÄ×ÜÊı, Ê§°Ü·µ»Ø -1
*******************************************************************************/
int menu_get_total( menu_t *menu );

/******************************************************************************/
/*!                    
* \par  Description:
*     menu »ñÈ¡µ±Ç°²Ëµ¥ÏîµÄÊı¾İ
* \ingroup common_menuview
* \param [in] menu: ²Ëµ¥Ö¸Õë   
* \return  ³É¹¦·µ»Ø µ±Ç°²Ëµ¥ÏîµÄÊı¾İÖ¸Õë, Ê§°Ü·µ»Ø NULL
*******************************************************************************/
menuitem_t* menu_get_cur_item( menu_t *menu );

/******************************************************************************/
/*!                    
* \par  Description:
*     menu »ñÈ¡Ö¸¶¨²Ëµ¥ÏîµÄÊı¾İ
* \ingroup common_menuview
* \param [in] menu: ²Ëµ¥Ö¸Õë 
* \param [in] index: ²Ëµ¥ÏîË÷Òı (È¡Öµ: 0 ~ N-1)   
* \return  ³É¹¦·µ»Ø ²Ëµ¥ÏîµÄÊı¾İÖ¸Õë, Ê§°Ü·µ»Ø NULL
*******************************************************************************/
menuitem_t* menu_get_item( menu_t *menu, int cur_index );

/******************************************************************************/
/*!                    
* \par  Description:
*     menu ÉèÖÃÖ¸¶¨²Ëµ¥ÏîµÄÊı¾İ
* \ingroup common_menuview
* \param [in] menu: ²Ëµ¥Ö¸Õë 
* \param [in] index: ²Ëµ¥ÏîË÷Òı (È¡Öµ: 0 ~ N-1)   
* \param [in] item: ²Ëµ¥ÏîÊı¾İÖ¸Õë
* \return  ³É¹¦·µ»Ø ²Ëµ¥ÏîµÄÊı¾İÖ¸Õë, Ê§°Ü·µ»Ø NULL
*******************************************************************************/
bool menu_set_item( menu_t *menu, int cur_index, menuitem_t *item );

/******************************************************************************/
/*!                    
* \par  Description:
*     menu ÍùÖ¸¶¨Î»ÖÃ²åÈë²Ëµ¥Ïî
* \ingroup common_menuview
* \param [in] menu: ²Ëµ¥Ö¸Õë
* \param [in] index: ²Ëµ¥ÏîË÷Òı (È¡Öµ: 0 ~ N)
* \param [in] item: ²Ëµ¥ÏîÊı¾İÖ¸Õë
* \return  ³É¹¦·µ»Øtrue, Ê§°Ü·µ»Øfalse      
*******************************************************************************/
bool menu_insert_item( menu_t *menu, int cur_index, menuitem_t *item );

/******************************************************************************/
/*!                    
* \par  Description:
*     menu Íù²Ëµ¥ÆğÊ¼Î»ÖÃ²åÈë²Ëµ¥Ïî
* \ingroup common_menuview
* \param [in] menu: ²Ëµ¥Ö¸Õë
* \param [in] item: ²Ëµ¥ÏîÊı¾İÖ¸Õë
* \return  ³É¹¦·µ»Øtrue, Ê§°Ü·µ»Øfalse      
*******************************************************************************/
bool menu_prepend_item( menu_t *menu, menuitem_t *item );

/******************************************************************************/
/*!                    
* \par  Description:
*     menu Íù²Ëµ¥Ä©Î²Î»ÖÃ×·¼Ó²Ëµ¥Ïî
* \ingroup common_menuview
* \param [in] menu: ²Ëµ¥Ö¸Õë
* \param [in] item: ²Ëµ¥ÏîÊı¾İÖ¸Õë
* \return  ³É¹¦·µ»Øtrue, Ê§°Ü·µ»Øfalse      
*******************************************************************************/
bool menu_append_item( menu_t *menu, menuitem_t *item );

/******************************************************************************/
/*!                    
* \par  Description:
*     menu Íù²Ëµ¥Ä©Î²Î»ÖÃ×·¼ÓN¸ö²Ëµ¥Ïî
* \ingroup common_menuview
* \param [in] menu: ²Ëµ¥Ö¸Õë
* \param [in] item: ²Ëµ¥ÏîÊı¾İÖ¸Õë
* \param [in] num: ²Ëµ¥Ïî¸öÊı
* \return  ³É¹¦·µ»Øtrue, Ê§°Ü·µ»Øfalse      
*******************************************************************************/
bool menu_append_items( menu_t *menu, menuitem_t *items, int num );

/******************************************************************************/
/*!                    
* \par  Description:
*     menu É¾³ıÖ¸¶¨Î»ÖÃµÄ²Ëµ¥Ïî
* \ingroup common_menuview
* \param [in] menu: ²Ëµ¥Ö¸Õë
* \param [in] index: ²Ëµ¥ÏîË÷Òı (È¡Öµ: 0 ~ N-1)
* \return  ³É¹¦·µ»Øtrue, Ê§°Ü·µ»Øfalse      
*******************************************************************************/
bool menu_remove_item( menu_t *menu, int cur_index );

/******************************************************************************/
/*!                    
* \par  Description:
*     menu É¾³ıÆğÊ¼Ò»Ïî²Ëµ¥Ïî
* \ingroup common_menuview
* \param [in] menu: ²Ëµ¥Ö¸Õë
* \return  ³É¹¦·µ»Øtrue, Ê§°Ü·µ»Øfalse      
*******************************************************************************/
bool menu_remove_first_item( menu_t *menu );

/******************************************************************************/
/*!                    
* \par  Description:
*     menu É¾³ı×îºóÒ»Ïî²Ëµ¥Ïî
* \ingroup common_menuview
* \param [in] menu: ²Ëµ¥Ö¸Õë
* \return  ³É¹¦·µ»Øtrue, Ê§°Ü·µ»Øfalse      
*******************************************************************************/
bool menu_remove_last_item( menu_t *menu );

/******************************************************************************/
/*!                    
* \par  Description:
*     menu É¾³ıËùÓĞ²Ëµ¥Ïî
* \ingroup common_menuview
* \param [in] menu: ²Ëµ¥Ö¸Õë
* \return  ³É¹¦·µ»Øtrue, Ê§°Ü·µ»Øfalse      
*******************************************************************************/
bool menu_remove_all_items( menu_t *menu );

/* menu ¸ß¼¶Êı¾İ½Ó¿Úº¯Êı */

/******************************************************************************/
/*!                    
* \par  Description:
*     menu ÉèÖÃ²Ëµ¥Êı¾İÔÚÈ«¾Ö²Ëµ¥ÖĞµÄÆ«ÒÆÁ¿
* \ingroup common_menuview
* \param [in] menu: ²Ëµ¥Ö¸Õë
* \param [in] offset: Æ«ÒÆÁ¿ (È¡Öµ: 0 ~ N-1)
* \return  ³É¹¦·µ»Øtrue, Ê§°Ü·µ»Øfalse      
* \note µ±È«¾Ö²Ëµ¥ÄÚÈİ¹ı¶àÖ»ÄÜÔØÈë²¿·ÖÄÚÈİÊ±Ê¹ÓÃ¸Ã½Ó¿Ú, Èçbrowser
*******************************************************************************/
bool menu_set_global_offset( menu_t *menu, int offset );

/******************************************************************************/
/*!                    
* \par  Description:
*     menu »ñÈ¡²Ëµ¥Êı¾İÔÚÈ«¾Ö²Ëµ¥ÖĞµÄÆ«ÒÆÁ¿
* \ingroup common_menuview
* \param [in] menu: ²Ëµ¥Ö¸Õë   
* \return  ³É¹¦·µ»Ø ²Ëµ¥Êı¾İÔÚÈ«¾Ö²Ëµ¥ÖĞµÄÆ«ÒÆÁ¿ (È¡Öµ: 0 ~ N-1), Ê§°Ü·µ»Ø -1
* \note µ±È«¾Ö²Ëµ¥ÄÚÈİ¹ı¶àÖ»ÄÜÔØÈë²¿·ÖÄÚÈİÊ±Ê¹ÓÃ¸Ã½Ó¿Ú, Èçbrowser
*******************************************************************************/
int menu_get_global_offset( menu_t *menu );

/******************************************************************************/
/*!                    
* \par  Description:
*     menu ÉèÖÃÈ«¾Ö²Ëµ¥ÖĞµÄ´óĞ¡
* \ingroup common_menuview
* \param [in] menu: ²Ëµ¥Ö¸Õë
* \param [in] size: È«¾Ö²Ëµ¥ÖĞµÄ´óĞ¡
* \return  ³É¹¦·µ»Øtrue, Ê§°Ü·µ»Øfalse      
* \note µ±È«¾Ö²Ëµ¥ÄÚÈİ¹ı¶àÖ»ÄÜÔØÈë²¿·ÖÄÚÈİÊ±Ê¹ÓÃ¸Ã½Ó¿Ú, Èçbrowser
*******************************************************************************/
bool menu_set_global_size( menu_t *menu, int size );

/******************************************************************************/
/*!                    
* \par  Description:
*     menu »ñÈ¡È«¾Ö²Ëµ¥ÖĞµÄ´óĞ¡
* \ingroup common_menuview
* \param [in] menu: ²Ëµ¥Ö¸Õë   
* \return  ³É¹¦·µ»Ø È«¾Ö²Ëµ¥ÖĞµÄ´óĞ¡, Ê§°Ü·µ»Ø -1
* \note µ±È«¾Ö²Ëµ¥ÄÚÈİ¹ı¶àÖ»ÄÜÔØÈë²¿·ÖÄÚÈİÊ±Ê¹ÓÃ¸Ã½Ó¿Ú, Èçbrowser
*******************************************************************************/
int menu_get_global_size( menu_t *menu );

#endif

